# 2. Выполнить логические побитовые операции «И», «ИЛИ» и др. над числами 5 и 6.
# Выполнить над числом 5 побитовый сдвиг вправо и влево на два знака.
# Объяснить полученный результат.

# Впервые столкнулся с побитовыми операциями такого плана читал про них на сайте https://neerc.ifmo.ru/wiki/index.php?title=%D0%9F%D0%BE%D0%B1%D0%B8%D1%82%D0%BE%D0%B2%D1%8B%D0%B5_%D0%BE%D0%BF%D0%B5%D1%80%D0%B0%D1%86%D0%B8%D0%B8
print('"И" = ', 5 & 6) # 5 это 101, 6 110, 1 и 1 это 1 1 и 0 это 0 выходит 100, 100 = 4
print('"ИЛИ" = ', 5 | 6) # А тут просто соединение как я понял если 0 и 1 это 1, 1 и 1 это тоже 1, и в итоге 111 а это 7


