# 4. Написать программу, которая генерирует в указанных пользователем границах:
# случайное целое число;
# случайное вещественное число;
# случайный символ.
# Для каждого из трех случаев пользователь задает свои границы диапазона.
# Например, если надо получить случайный символ от 'a' до 'f', то вводятся эти символы.
# Программа должна вывести на экран любой символ алфавита от 'a' до 'f' включительно.

# Импортируем модуль.
import random # from random import randint, uniform Как лучше делать?

# Вывод информации с выбором дальнейших действий.
res = int(input('Выберите операцию: \n'
                '1. Случайное число. \n'
                '2. Случайное вещественное число. \n'
                '3. Случайный символ. \n'
                'Ваш выбор: '))
# Разветвление куда направится в зависимости от выбора пользователя.
if res == 1:
    a = int(input('Введите минимум для подбора случайного числа: '))   # Можно сделать одним запросом с использованием .split()
    b = int(input('Введите максимум для подбора случайного числа: '))
    # Использование модуля для генерации случайного числа в заданных границах.
    print(random.randint(a, b))
elif res == 2:
    a = int(input('Введите минимум для подбора случайного вещественного числа: '))
    b = int(input('Введите максимум для подбора случайного вещественного числа: '))
    print(random.uniform(a, b)) # Можно результат ограничить по количеству символов после запятой
elif res == 3:
    a = input('Введите начальный символ: ')
    b = input('Введите конечный символ')
    print(chr(random.randint(ord(a), ord(b))))
else:
    print('Ошибка ввода!!!')
