# 5. Пользователь вводит две буквы.
# Определить, на каких местах алфавита они стоят и сколько между ними находится букв.

# Очень сложное задание по скольку не понимал взаимодействия с алфавитом, читал про ord знал о ней достаточно только
# для выполнения предыдущего задания, поскольку сталкивался уже с подобным.
# Пока читал, смотрел, нашел подобное задание в интернете разобрал по нему что зачем и как, сделал свой вариант.
a = input('Введите первую букву: ')
b = input('Введите вторую букву: ')
a = ord(a) - ord('a') + 1
b = ord(b) - ord('a') + 1
print('Позиция первой буквы = ', a, ', позиция второй = ', b)
print('Между буквами ', b - a, 'букв')