# 6. Пользователь вводит номер буквы в алфавите. Определить, какая это буква.

# Тяжело далось задание из-за того что не помнил как лучше работать с ord и chr
a = int(input('Введите порядковый номер буквы: '))
b = ord('a') + a - 1
print('Буква - ', chr(b))
