# 7. По длинам трех отрезков, введенных пользователем,
# определить возможность существования треугольника, составленного из этих отрезков.
# Если такой треугольник существует, то определить,
# является ли он разносторонним, равнобедренным или равносторонним.

# Запрос длин сторон.
a = int(input('a = : '))
b = int(input('b = : '))
c = int(input('c = : '))

# Проверка на возможность существования данного треугольника. Треугольник существует только тогда,
# когда сумма двух его сторон больше третьей.
if a + b >= c and b + c >= a and a + c >= b:
    # В Разносторонем длины всех сторон должны быть не равны.
    if a != b != c:
        print('Разностороний треугольник.')
    # В равнобедренном две стороны равны.
    elif a == b != c or b == c != a or a == c != b:
        print('Равнобедренный треугольник.')
    # С учётом того что есть проверка на существование можно не прписывать условия равностороннего.
    # elif a == b == c:
    else:
        print('Равностороний треугольник.')
else:
    print('Длины сторон не соответствуют треугольнику.')

