# 8. Определить, является ли год, который ввел пользователем, високосным или невисокосным.

# Сделано по спойлеру с лекции)

year = int(input('Введите год, чтобы узнать високосный ли он: '))
if year >= 1516:
    if year % 4 != 0:
        print(year, 'невисокосный')
    elif year % 100 != 0:
        print(year, 'високосный')
    elif year % 400 == 0:
        print(year, 'високосный')
    else:
        print(year, 'невисокосный')
else:
    print('Високосный год был с 1516')