# 9. Вводятся три разных числа. Найти, какое из них является средним (больше одного, но меньше другого).

# Последний elif можно заменить на else, но лучше оставить его на случай ошибки ввода или ещё какой.
# 1 вариант не работает если есть одинаковые числа, можно заменить < на <=, будет выдавать меньший результат,
# но это не по условию задания.
#
# 1 варинта

a = int(input('Первое число: '))
b = int(input('Второе число: '))
c = int(input('Третье число: '))
if b < a < c or c < a < b:
    print('Среднее число = ', a)
elif a < b < c or c < b < a:
    print('Среднее число = ', b)
elif a < c < b or b < c < a:
    print('Среднее число = ', c)

# 2 вариант. С проверкой что бы не было одинаковых цифр

# Запрашиваем вводные данные.
a = int(input('Первое число: '))
b = int(input('Второе число: '))
c = int(input('Третье число: '))
# Проверяем на то что все цифры разные.
if a != b != c:
    # Проверяем каждое число на соответствие заданным параметрам.
    if b < a < c or c < a < b:
        print('Среднее число = ', a)
    elif a < b < c or c < b < a:
        print('Среднее число = ', b)
    elif a < c < b or b < c < a:
        print('Среднее число = ', c)
else:
    print('Цифры должны быть разными.')