# 1. Проанализировать скорость и сложность одного любого алгоритма,
# разработанных в рамках домашнего задания первых трех уроков.
# Примечание: попробуйте написать несколько реализаций алгоритма и сравнить их.


# Для задания выбрал задание 2.2. Способ измерения времени крайне не эфективен, в плане елси нужно очень точное
# измерение скорости, но этот способ имеет место быть для сравнения приблезительного времени между подобными вариантами
# между друг другом, можно сравнить приблизительно по нескольким замерам.
# Для проверки замера таким способом код нужно запускать по одному, а не всем файлом.
# Я не очень понял как измерить общую сложность алгоритма, поэтому там пока что указана сложность отдельных участков
# кода.
# После разбора дз буду ещё смотреть данные варианты)
# Читал про timeit как понимаю его самый лучший способ использовать через командную строку.
# Понял как измерять скорость с функциями через cProfile, а как это делать когда нет функции не понятно.
import timeit

# ~0.000031sec
start_time = timeit.default_timer()
number = '1234232'
even = []
odd = []
for i in number:  # Сложность цикла в данном случае это O(n)
    if int(i) % 2 == 0:
        even.append(i)  # Добавление элемента в список O(1)
    elif int(i) % 2 != 0:
        odd.append(i)  # O(1)

print(f'even/odd : {len(even)}/{len(odd)}')  # O(1) and O(1)
print(timeit.default_timer() - start_time)


# ~0.00003sec данную функцию проверял ещё и через модуль cProfile ну и как ожидаемо разные результаты
# (кординально разные)
def even_odd():
    n = '1234232'
    even_b = []
    odd_b = []
    for x in n:
        if int(x) % 2 == 0:
            even_b.append(x)
        elif int(x) % 2 != 0:
            odd_b.append(x)
    return f'even/odd: {len(even_b)}/{len(odd_b)}'


start_time_b = timeit.default_timer()
print(even_odd())
print(timeit.default_timer() - start_time_b)

# ~0.000034sec
start_time_a = timeit.default_timer()
a = '1234232'
even_a = 0
odd_a = 0

for item in a:
    if item.isdigit():
        if int(item) % 2 == 0:
            even_a += 1
        else:
            odd_a += 1
    else:
        print('Нужно вводить число!')
        exit(0)

print(f'even/odd : {even_a}/{odd_a}')
print(timeit.default_timer() - start_time_a)
