# 1. Определение количества различных подстрок с использованием хэш-функции. Пусть дана строка S длиной N,
# состоящая только из маленьких латинских букв. Требуется найти количество различных подстрок в этой строке.
import hashlib
# я не знаю стоило ли делать это задание через модуль или нет, вот так у меня получилось.

s = 'gvyghbighutxxxdcgvjk'
sum_s = []  # Возможно тут нужно было через множество

for i in range(len(s)):
    for x in range(len(s), i, -1):
        hash_s = hashlib.sha1(s[i:x].encode('utf-8')).hexdigest()
        sum_s.append(hash_s)

print(f'{len(sum_s) -1} {s}')
