# 2. Посчитать четные и нечетные цифры введенного натурального числа.
# Например, если введено число 34560, то у него 3 четные цифры (4, 6 и 0) и 2 нечетные (3 и 5).

# Запрашиваем у пользователя число.
number = input('Введите число: ')
# Создаём два пустых списка чётных и нечётных.
even = []
odd = []
# Из-за того что я не смог сделать с запросом числа, проходим по строке переделываем тип и добавляем в соответсвующий
# список, не использовал else на тот случай если нужно использовать его для исключения букв или ещё каких возможных
# ошибок.
for i in number:
    if int(i) % 2 == 0:
        even.append(i)
    elif int(i) % 2 != 0:
        odd.append(i)
# В выводе просто подсчитываем длину списков.
print(f'Количество чётных {len(even)} \n'
      f'Количество нечЁтных {len(odd)}')
