# 4. Найти сумму n элементов следующего ряда чисел: 1 -0.5 0.25 -0.125 ...
# Количество элементов (n) вводится с клавиатуры.

# Запрашиваем число для длины последовательности, указываем стартовое значение списка
# и создаём пустой список куда будем всё помещать.
num = int(input('Введите число: '))
start = 1
list_sum = []
# Создаём цикл добавляющий в него стартовое значение и делим его на -2 для изменения знака и деления
for i in range(num):
    list_sum.append(start)
    start /= -2
print(list_sum)
print(sum(list_sum))
