# 5. Вывести на экран коды и символы таблицы ASCII, начиная с символа под номером 32 и заканчивая 127-м включительно.
# Вывод выполнить в табличной форме: по десять пар "код-символ" в каждой строке.

# Что то дальше чем это продвинуться не смог, не понимаю как вывести по 10
for i in range(32, 128):
    print(i, chr(i))

a = [i for i in range(32, 128)]
b = [chr(i) for i in range(32, 128)]
