# 6. В программе генерируется случайное целое число от 0 до 100.
# Пользователь должен его отгадать не более чем за 10 попыток.
# После каждой неудачной попытки должно сообщаться больше или меньше введенное пользователем число,
# чем то, что загадано. Если за 10 попыток число не отгадано, то вывести загаданное число.

from random import randint

hidden_number = randint(0, 100)

i = 0
while i != 10:
    user_number = int(input('Угадайте загаданое число: '))
    if user_number == hidden_number:
        print(f'Поздравляем вы угадали с {i + 1} попытки.')
        break
    elif user_number < hidden_number:
        print(f'Ваш вариант меньше загаданного числа. Осталось {9 - i} попыток')
        i += 1
    elif user_number > hidden_number:
        print(f'Ваш вариант больше загаданного числа. Осталось {9 - i} попыток')
        i += 1
print('Попытки закончились.')
