# 7. Напишите программу, доказывающую или проверяющую,
# что для множества натуральных чисел выполняется равенство:
# 1+2+...+n = n(n+1)/2, где n - любое натуральное число.

# Запрашиваем длину последовательности и сразу её делаем списком и заносим сумму в новую переменную.
n = int(input('Введите число: '))
left = [int(i) for i in range(1, n + 1)]
sum_left = sum(left)
# Зная значение левой части высчитываем значение правой и сравниваем их.
sum_right = n * (n + 1) / 2

if sum_left == sum_right:
    print(f'Сумма левой части = {sum_left}, сумма правой части = {sum_right}, Они равны')
else:
    print(f'Сумма левой части = {sum_left}, сумма правой части = {sum_right}, Они не равны')
