# 8. Посчитать, сколько раз встречается определенная цифра в введенной последовательности чисел.
# Количество вводимых чисел и цифра, которую необходимо посчитать, задаются вводом с клавиатуры.

# Опять же в задание использован читинг. Данные задания смог бы сделать с приёмом на вход числа
# если запрашивать числа по одному, а не все через пробел. Поэтому очень жду лекцию)

# Запрашиваем у пользователя последовательность чисел через пробел, принемаем их в типе строки.
numbers = input('Введите числа через пробел: ')
# Создаём список из введёных чисел пользователем.
list_numbers = numbers.split()
# Данный принт просто для контроля
print(list_numbers)

number = int(input('Введите число поиска: '))

# Переменная result служит счётчиком сколько раз встречается число.
result = 0

# В цикле идём по списку, потом переводим элемент списка в int и сравниваем, если совпадает то +1 счётчику.
for i in list_numbers:
    if int(i) == number:
        result += 1

print(result)
