# 1. В диапазоне натуральных чисел от 2 до 99 определить,
# сколько из них кратны каждому из чисел в диапазоне от 2 до 9.

# Создаём список в заданном диапазоне.
numbers = [int(i) for i in range(2, 100)]
# Создаём список с необходимым количеством нулей каждый ноль это счётчик для определенного числа из проверки кратности.
list_a = [0, 0, 0, 0, 0, 0, 0, 0]
# Начинаем цикл с числа на чью кратность проверяем, и проходим этим числом по списку
# и при соответствие делаем +1 к элементу списка который счётчик.
for x in range(2, 10):
    for number in numbers:
        if number % x == 0:
            list_a[x - 2] += 1  # x - 2  потому что его мы берём с 2, а элементы в списке счётчике начинаются с нуля.
            # И пытаясь понять это и не понимая почему не работает, потратил очень много времени пока не понял
            # что обращался к списку счётчику не к тем индексам)
    print(f'Кратных {x} - {list_a[x - 2]}')
