# 2. Во втором массиве сохранить индексы четных элементов первого массива.
# Например, если дан массив со значениями 8, 3, 15, 6, 4, 2,
# то во второй массив надо заполнить значениями 1, 4, 5, 6 (или 0, 3, 4, 5 - если индексация начинается с нуля),
# т.к. именно в этих позициях первого массива стоят четные числа.

# Тут использую тот же список что и в первом задание проверю его на чётность
# и создам новый список в который будут внесены индексы чётных чисел.
# Со списком из задания тоже проверил всё работает.

numbers = [int(i) for i in range(2, 100)]
even_idx = []
for i in numbers:
    if i % 2 == 0:
        idx = numbers.index(i)  # Берём индекс числа.
        even_idx.append(idx + 1)  # +1 это если хотим что бы индекс начинался не с нуля,
        # если планировалось бы что то ещё с этим списком тогда оставили бы с нуля.
print(numbers)
print(even_idx)
