# 4. Определить, какое число в массиве встречается чаще всего.

# Изначально задание решил делать с счётчиком как в первом задание,
# и проверка шла через два цикла сравнивая каждый элемент списка с со всем списком повышая счётчик при совпадение,
# но вариант оказался не корректно рабочим и пока пытался его оптимизировать вспоинил про метод count.

# Создаём список чисел.

from random import randint
numbers = []
for i in range(100):
    x = randint(1, 100)
    numbers.append(x)
print(numbers)

# Вводим две переменных одна будет хранить сколько чисел одинаковых есть в списке чтоб сравнивать с ней,
# а вторая само число.

max_count_num = 0
max_num = 0

# Идём по списку, сравнивая количество вхождений элемента в список при помощи count,
# если больше текущего значения max_count_num,
# то меняем значение на новое и фиксируем число.

for i in numbers:
    if numbers.count(i) > max_count_num:
        max_count_num = numbers.count(i)
        max_num = i

print(max_num)
