# 5. В массиве найти максимальный отрицательный элемент. Вывести на экран его значение и позицию в массиве.

# Создаём список.
from random import randint
numbers = []
for i in range(100):
    x = randint(-100, 100)
    numbers.append(x)
print(numbers)
# Вот тут главная загвоздка, как реализовать, не знаю что присвоить такой переменной чтоб плясать от неё,
# придумал только такой выход из этой ситуации, подходит если известен порог минимального отрицательного,
# значения. Вариант со звёздочкой не смог.
max_negative = -99999999
idx = 0
# Простой цикл берущий число и сравнивающий его по нужным параметрам.
for i in numbers:
    if i < 0:
        if i > max_negative:
            max_negative = i
            idx = numbers.index(i)

print(f'{max_negative} позиция {idx+1}')
