# 7. В одномерном массиве целых чисел определить два наименьших элемента.
# Они могут быть как равны между собой (оба являться минимальными), так и различаться.

# Первое что пришло в голову это сделать через сортировку и срез.
# Хотел сделать ещё вариант без использования sorted, но как реализовать другой способ эффективнее
# я что то не представляю как, ибо все эти варианты будут много раз ходить по списку и есть ресурсы.
from random import randint
numbers = []
for i in range(10):
    x = randint(0, 10)
    numbers.append(x)
print(numbers)

sort_numbers = sorted(numbers)
print(sort_numbers[0:2][0], sort_numbers[0:2][1])
