# 8. Матрица 5x4 заполняется вводом с клавиатуры кроме последних элементов строк.
# Программа должна вычислять сумму введенных элементов каждой строки и записывать ее в последнюю ячейку строки.
# В конце следует вывести полученную матрицу.

# Создаём пустой список который станет в итоге матрицей.
matrix = []
# Запускаем цикл, а в цикле цикл, и таким образом собираем по строкам, создаём пустой список и заполняем его,
# а в конце его сумму докидываем в конец строки.
for i in range(4):
    list_a = []
    for x in range(4):
        element = int(input(f'Введите {x + 1} элемент {i + 1} строки'))
        list_a.append(element)
    list_a.append(sum(list_a))
    matrix.append(list_a)

for i in matrix:
    print(i)
