# 9. Найти максимальный элемент среди минимальных элементов столбцов матрицы.

# Взял заведомо написаную матрицу.
matrix = [
    [12, 32, 23, 12, 79],
    [56, 45, 34, 23, 158],
    [45, 34, 23, 12, 114],
    [3, 45, 6, 7, 61]
]
# Создаём пустой список для заполнения его минимальными числами. Возможно красиво объединить с 8 заданием.
list_a = []
# Идём по циклу и извлекаем столбец сразу находя его минимальное значение и добавляя минимальное в основной список.
for i in range(5):
    list_b = []
    for x in range(4):
        list_b.append(matrix[x][i])
    min_num = min(list_b)
    list_a.append(min_num)

print(list_a)
print(max(list_a))
