# 1. Пользователь вводит данные о количестве предприятий, их наименования и прибыль за 4 квартала
# (т.е. 4 отдельных числа) для каждого предприятия.. Программа должна определить среднюю прибыль
# (за год для всех предприятий) и вывести наименования предприятий,
# чья прибыль выше среднего и отдельно вывести наименования предприятий, чья прибыль ниже среднего.

from collections import defaultdict

# запрашиваем сколько компаний.
amount_company = int(input('Введите количество компаний: '))
# Тут мы создаём переменные, переменную company можно сделать и обычным словарём.
# Вторая переменная это общая заработаная сумма всеми.
# Третья это количество кварталов (можно было её не делать, а просто в цикле с ней указать 4)
company = defaultdict()
income_all = 0
quarter = 4
# Циклы которые заполняют имена и поквартально прибыль компаний,
# фиксируя в значениях общую прибыль за год каждой компании и после этого прибавляют к общей прибыле.
for i in range(amount_company):
    name_company = input(f'Введите имя {i + 1} компании: ')
    income = 0
    for x in range(quarter):
        income_quarter = int(input(f'Введите прибыль за {x + 1} квартал: '))
        income += income_quarter
    company[name_company] = income
    income_all += income
# Средняя прибыль всех компаний.
average_income = income_all / amount_company
# Пустые списки что бы восить в них имена компаний по соответствиям.
above = []
below = []
equals = []
# Проверка и распределение что куда идёт, если нужно было бы выводить  прибыль, а не имена изменения были бы как раз
# в этой части.
for i, x in company.items():
    if x > average_income:
        above.append(i)
    elif x < average_income:
        below.append(i)
    elif x == average_income:
        equals.append(i)
# Можно сделать вывод с распечатованием списка церез цикл оформить как либо иначе.
print(f'Средняя прибыль всех компаний = {round(average_income, 2)}\n'
      f'Прибыль выше среднего у {above}\n'
      f'Прибыль ниже среднего у {below}\n'
      f'Прибыль равная средней у {equals}')
